#Generated by Fabric Compiler ( version 2021.1-SP1 <build 72666> ) at Tue May 25 10:37:27 2021

set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
add_fic "E:/xiamgmu/pcie/100H_pcie/dong_EP_gen2x4/ipcore/pcie/pnr/example_design/synthesize/pango_pcie_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
add_fic "E:/xiamgmu/pcie/100H_pcie/dong_EP_gen2x4/ipcore/pcie/pnr/example_design/synthesize/pango_pcie_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
report_timing 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
add_fic "E:/xiamgmu/pcie/100H_pcie/dong_EP_gen2x4/ipcore/pcie/pnr/example_design/synthesize/pango_pcie_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pango_pcie_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
